# Pandas

Pandas es una libreria utilizada para la manipulación y analisis de datos tabulares y series temporales. Con Pandas podemos interactuar con DataFrames o Series, que permiten cargar, limpiar, transformar y analizar datos de manera eficiente.

Para hacer uso de Pandas debemos importar la libreria en nuestro proyecto:

In [10]:
import pandas as pd

Primero debemos definir la ruta donde se ubica el archivo de datos, los datos se pueden encontrar en un archivo de tipo csv, excel, sql, json, etc.

In [11]:
path = "/home/joao/Descargas/datos_rrss.xlsx"

In [23]:
data = pd.read_excel(path, sheet_name='Hoja2', names=["Name", "Amount", "Status", "Year"])

In [24]:
data

        Name  Amount  Status  Year
0   Facebook    2449    True  2006
1    Twitter     339   False  2006
2  Instagram    1000    True  2010

In [21]:
data = pd.read_excel(path, sheet_name='Hoja3', header=None, names=["Name", "Amount", "Status", "Year"])

In [22]:
data

        Name  Amount  Status  Year
0   Facebook    2449    True  2006
1    Twitter     339   False  2006
2  Instagram    1000    True  2010
3    YouTube    2000   False  2005
4   LinkedIn     663   False  2003
5   WhatsApp    1600    True  2009

Definimos una variable donde almacenaremos la ruta del archivo que vamos a crear.

In [ ]:
path_to_save = "/home/joao/Descargas/save.csv"

Podemos guardar un dataframe en un archivo `csv`, `xlsx`, `json`, `sql`, `latex`, etc.

In [ ]:
data.to_csv(path_to_save)

Ahora crearemos un objeto "datos" y le asignaremos un dataframe creado a partir de un diccionario.

In [26]:
datos = pd.DataFrame({'A':[1, 2, 3], 'B': [100, 101, 102]})

In [27]:
datos

   A    B
0  1  100
1  2  101
2  3  102

Un dataframe es un objeto que almacena datos tabulares bidimensionales, de tamaño mutable y potencialmente heterogéneos

Ahora crearemos un objeto "datos" y le asignaremos un conjunto de datos tipo Serie creado a partir de una lista.

In [28]:
datos = pd.Series([100, 200, 300, 400])

In [29]:
datos

0    100
1    200
2    300
3    400
dtype: int64